package com.hxzy.basic.day1;

/**
 * 数据类型、进制、进制转换
 */
public class ValueType {
    int x = 10;//成员变量（类里定义）

    public static void main(String[] args) {
        int num = 20;//局部变量（方法内定义）
        //八种基本数据类型
        //数值类型
        byte b = 8;//字节型：占用1个字节，取值范围-128~127
        short s = 10;//短整型：占用2个字节，取值范围-32768~32767
        int i = 10;//整型：占用4个字节，
        long lon = 100L;//长整型：占用8个字节
        float f = 10.98F;//单精度浮点型：占用4个字节
        double d = 3.1415926D;//双精度浮点型，占用8个字节

        char c = 'A';//占用2个字节，范围：0~65535
        boolean bool = true;//占用字符不确定，
        /*定义变量的格式：
        类型 变量名；//声明一个变量
        类型 变量名 = 值；//声明同时赋值
        变量名 = 值；//声明后直接赋值*/
        b = 20;//赋值
        char c2 = 97;//ascii码表
        System.out.println(c2);
        //二进制：0b开头 0b1011
        //八进制：0开头，07
        //十六进制：0x开头，0f
        //补码：首位0表示正数，1表示负数
        //负数，绝对值的二进制按位取反再加1
        //-8
        //0000 1000
        //1111 0111
        //0000 1000
        //十进制转二进制：
        // 整数部分：除2取余，逆序排列
        // 小数部分：乘2取整，顺序排列
        //int a, b, c;
        //a = 23;
        //b = 0b01010;
        //c = 20;
        //int age = c;
        //int x = 0x25, y = 0x3a, z = 25;
        //System.out.println(a + " " + b + " " + age + " " + x + " " + y + " " + z);
        //byte b1 = 0b1000000, b2 = 0b00000000;
        //System.out.println(b1 + " " + b2);
    }
}
